{"pageProps":{"slug":"about","data":{"frontmatter":{"title":"About The Author","image":"/images/author.png","description":"meta description","layout":"about","education":{"title":"Formal Education","degrees":[{"university":"Southeast University","content":"1985 • 1991 • gravida nibh velvelit auctor alimo quet menean solli"},{"university":"Northeast University","content":"1985 • 1991 • gravida nibh velvelit auctor alimo quet menean solli"},{"university":"Easteast University","content":"1985 • 1991 • gravida nibh velvelit auctor alimo quet menean solli"},{"university":"Southeast University","content":"1985 • 1991 • gravida nibh velvelit auctor alimo quet menean solli"}]},"experience":{"title":"Work Experience","list":["Best Writer Award","Best New Newel","Best Book","Best Article","Best New Newel","Best New Newel","Best Book","Best Article","Best New Newel","Best Book"]}},"content":"\n> I’m Sulojan, an education researcher and advocate focused on making mathematics more inclusive for learners with Special Educational Needs (SEN). My work explores challenges like dyscalculia and maths anxiety, drawing on research and case studies from Sri Lanka, Europe, and worldwide. I believe every child should have the tools, confidence, and support to succeed in maths—regardless of their background or learning style.\n\n> Through this blog, I share insights, practical strategies, and global best practices to bridge the SEN learning gap. I’m also developing an innovative platform aimed at personalising maths education for SEN students, with the goal of making high-quality support accessible and affordable. My hope is to connect educators, parents, technologists, and policymakers who share the vision of a world where every learner counts.\n\nThis is where I share my research, insights, and ideas on one of the most overlooked challenges in education, supporting learners with Special Educational Needs (SEN), particularly in mathematics.\n\nAround the world, millions of children face difficulties in numeracy due to conditions like dyscalculia, yet many go undiagnosed and unsupported. My mission is to explore these challenges, highlight global best practices, and advocate for solutions that make mathematics more accessible, engaging, and confidence building for every learner.\n\nThrough articles, case studies, and thought pieces, I’ll connect lessons from countries like Sri Lanka, the UK, and across Europe, showing how we can bridge the gap with innovation, policy change, and inclusive teaching strategies.\n\nIf you care about giving every child the chance to succeed in maths and in life you’re in the right place. Let’s learn, share, and build change together.\n","mdxContent":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    blockquote: \"blockquote\",\n    p: \"p\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"I’m Sulojan, an education researcher and advocate focused on making mathematics more inclusive for learners with Special Educational Needs (SEN). My work explores challenges like dyscalculia and maths anxiety, drawing on research and case studies from Sri Lanka, Europe, and worldwide. I believe every child should have the tools, confidence, and support to succeed in maths—regardless of their background or learning style.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"Through this blog, I share insights, practical strategies, and global best practices to bridge the SEN learning gap. I’m also developing an innovative platform aimed at personalising maths education for SEN students, with the goal of making high-quality support accessible and affordable. My hope is to connect educators, parents, technologists, and policymakers who share the vision of a world where every learner counts.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This is where I share my research, insights, and ideas on one of the most overlooked challenges in education, supporting learners with Special Educational Needs (SEN), particularly in mathematics.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Around the world, millions of children face difficulties in numeracy due to conditions like dyscalculia, yet many go undiagnosed and unsupported. My mission is to explore these challenges, highlight global best practices, and advocate for solutions that make mathematics more accessible, engaging, and confidence building for every learner.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Through articles, case studies, and thought pieces, I’ll connect lessons from countries like Sri Lanka, the UK, and across Europe, showing how we can bridge the gap with innovation, policy change, and inclusive teaching strategies.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you care about giving every child the chance to succeed in maths and in life you’re in the right place. Let’s learn, share, and build change together.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}}},"__N_SSG":true}